Revit 2024 API
BuiltInFailures.InaccurateFailures.InaccurateLine Property
 Line is slightly off axis and may cause inaccuracies.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InaccurateLine { get; }
Visual Basic
Public Shared ReadOnly Property InaccurateLine As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InaccurateLine {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.InaccurateFailures Class
Autodesk.Revit.DB Namespace